{
  "personalInfo": {
    "name": "Anthony Okala",
    "title": "IT Consultant & Software Engineer",
    "subtitle": "Expert in Process Automation, RPA, Software & Web Development, and AI-Driven Solutions",
    "description": "With over 10 years of expertise in automation, software development, machine learning, and safety-critical systems. Specializing in Java, Python, JavaScript, TypeScript, PHP, and modern frameworks such as React, Django, Spring Boot, and Laravel. Expert in UiPath, KNIME Analytics, and Power Automate. Fluent in English, German, and French.",
    "keywords": "IT Consultant, Software Engineer, RPA, Automation, Python, Java, Web Development, AI Solutions"
  },
  "rotatingTitle": "{IT / RPA Consultant}",
  "floatingCards": [
    {
      "index": 1,
      "icon": "fas fa-code",
      "text": "Java"
    },
    {
      "index": 2,
      "icon": "fas fa-robot",
      "text": "RPA"
    },
    {
      "index": 3,
      "icon": "fas fa-brain",
      "text": "AI/ML"
    },
    {
      "index": 4,
      "icon": "fas fa-cloud",
      "text": "Cloud"
    },
    {
      "index": 5,
      "icon": "fas fa-code",
      "text": "Python"
    },
    {
      "index": 6,
      "icon": "fas fa-code",
      "text": "JavaScript"
    },
    {
      "index": 7,
      "icon": "fas fa-code",
      "text": "TypeScript"
    },
    {
      "index": 8,
      "icon": "fas fa-project-diagram",
      "text": "React.js"
    },
    {
      "index": 9,
      "icon": "fas fa-project-diagram",
      "text": "Django"
    },
    {
      "index": 10,
      "icon": "fas fa-project-diagram",
      "text": "Spring Boot"
    },
    {
      "index": 11,
      "icon": "fas fa-project-diagram",
      "text": "Laravel"
    },
    {
      "index": 12,
      "icon": "fas fa-project-diagram",
      "text": "Node.js"
    }
  ],
  "socialLinks": [
    {
      "url": "https://www.linkedin.com/in/anthony-okala-b87a98190/",
      "icon": "fab fa-linkedin",
      "name": "LinkedIn"
    },
    {
      "url": "https://github.com/asokVA20",
      "icon": "fab fa-github",
      "name": "GitHub"
    },
    {
      "url": "https://gitlab.com/asok.va20",
      "icon": "fab fa-gitlab",
      "name": "GitLab"
    }
  ],
  "about": {
    "journey": "I'm Anthony Okala, an experienced IT Consultant and Software Engineer with over 10 years of expertise in automation, software and web development, machine learning, and system development for safety-critical applications. I hold a Master's degree in Computer Science from Technical University of Clausthal.",
    "current": "Currently serving as IT Consultant at DB Regio AG, I specialize in developing automation solutions using Python and UiPath, achieving 80% reduction in manual effort with a goal to reach 99% automation. I'm also the Co-Founder & CEO of ASOK Solutions Engineering SARL.",
    "expertise": "My expertise spans across RPA development, full-stack web development, software development, machine learning, and system architecture, with proven experience working with automotive clients like Volkswagen AG and delivering solutions for safety-critical systems and DB Regio AG by delivering automation solutions.",
    "expertiseItems": [
      {
        "icon": "fas fa-cogs",
        "title": "Process Automation"
      },
      {
        "icon": "fas fa-robot",
        "title": "RPA Development"
      },
      {
        "icon": "fas fa-laptop-code",
        "title": "Software Development"
      },
      {
        "icon": "fas fa-code",
        "title": "Full-Stack Development"
      }
    ],
    "stats": [
      {
        "number": "10+",
        "label": "Years Experience"
      },
      {
        "number": "25+",
        "label": "Projects Completed"
      },
      {
        "number": "25+",
        "label": "Technologies"
      },
      {
        "number": "3",
        "label": "Languages"
      },
      {
        "number": "80%",
        "label": "Automation Achieved"
      },
      {
        "number": "Level 4",
        "label": "Drone Navigation"
      }
    ]
  },
  "projects": [
    {
      "icon": "fas fa-shoe-prints",
      "title": "Daimon Platform",
      "description": "Enterprise-grade microservices platform connecting customers with shoe repair businesses. Features 8 independent microservices, event-driven architecture, and full-stack applications (Next.js web dashboard, React Native mobile app).",
      "tags": ["Python", "FastAPI", "Next.js", "React Native", "TypeScript", "PostgreSQL", "RabbitMQ", "Docker", "Microservices"],
      "detailsUrl": "#daimon-platform-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true, 
      "future": true
    },
    {
      "icon": "fas fa-users",
      "title": "LeitApp Platform",
      "description": "Enterprise-grade immigration and integration platform with 19+ microservices across Python, TypeScript, Java, and PHP. Features mentorship, document management, job marketplace, AI assistance, and community features.",
      "tags": ["Python", "Django", "NestJS", "Spring Boot", "Laravel", "Next.js", "TypeScript", "PostgreSQL", "Microservices", "AI/ML"],
      "detailsUrl": "#leitapp-platform-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true, 
      "future": true
    },
    {
      "icon": "fas fa-tools",
      "title": "Multipurpose Service Website",
      "description": "Production-ready, full-stack cross-platform application (iOS, Android, Web) with CMS, contact forms, GDPR compliance, and administrative controls. Built with React Native, Expo, Express.js, and SQLite.",
      "tags": ["React Native", "Expo", "TypeScript", "Express.js", "SQLite", "Node.js", "Cross-Platform"],
      "detailsUrl": "#multipurpose-service-website-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-truck",
      "title": "Logistics Marketplace MVP",
      "description": "Full-stack multilingual logistics marketplace connecting shippers with service providers. Features three-role system (Shipper, Provider, Admin), provider matching, booking system, payment processing, and messaging.",
      "tags": ["NestJS", "React Native", "TypeScript", "SQLite", "TypeORM", "i18n", "JWT", "Expo"],
      "detailsUrl": "#logistics-marketplace-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-shopping-cart",
      "title": "Multipurpose Website",
      "description": "Production-ready, full-stack web application with e-commerce functionality, content management, user authentication, and administrative controls. Built with Next.js 14, TypeScript, Prisma, and NextAuth.js.",
      "tags": ["Next.js", "TypeScript", "Prisma", "NextAuth.js", "Zustand", "Tailwind CSS", "E-commerce"],
      "detailsUrl": "#multipurpose-website-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-store",
      "title": "E-Commerce Dropshipping Platform",
      "description": "Full-stack e-commerce dropshipping platform with AI-powered search, conversational commerce, Stripe payments, returns management, shipping provider integration (USPS), and supplier/dropshipping APIs. PWA support, Docker deployment, and monitoring (Prometheus/Grafana).",
      "tags": ["Next.js", "React 19", "TypeScript", "PostgreSQL", "Stripe", "OpenAI", "Docker", "PWA", "Playwright", "Jest"],
      "detailsUrl": "#ecommerce-dropshipping-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-laptop-code",
      "title": "Web & Mobile Platform",
      "description": "Enterprise-grade corporate website with full legal compliance (DSG - Swiss Data Protection Act), responsive design, and advanced UX features. Built with Next.js 14, TypeScript, and modern web standards.",
      "tags": ["Next.js", "TypeScript", "React", "CSS3", "DSG Compliance", "SEO"],
      "detailsUrl": "#web-mobile-platform-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-heartbeat",
      "title": "Women's Health NGO Website",
      "description": "Production-ready, full-stack web application for a Women's Health NGO focused on breast cancer awareness. Features complete CMS, interactive forms, dynamic routing, and enterprise-grade architecture.",
      "tags": ["Next.js", "TypeScript", "React Hook Form", "Tailwind CSS", "API Routes"],
      "detailsUrl": "#breast-cancer-ngo-website-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-music",
      "title": "Composer Portfolio Website",
      "description": "Modern, multilingual portfolio website for a classical composer with internationalization (i18n), interactive music player, works catalog with filtering, and responsive design. Built with Next.js 14 and TypeScript.",
      "tags": ["Next.js", "TypeScript", "next-intl", "Framer Motion", "Tailwind CSS", "i18n"],
      "detailsUrl": "#composer-website-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-route",
      "title": "Driver Order Optimizer",
      "description": "Full-stack application for optimizing order management and daily planning for vehicle drivers (Fahrzeugüberführer). The system integrates with Google Maps API for routing calculations and provides an interactive dashboard for plan visualization, route planning, and order management.",
      "tags": ["Next.js", "Express.js", "TypeScript", "JavaScript", "Material UI", "Docker", "Dev Containers", "Node.js", "React", "REST API", "Google Maps API", "Zod", "Luxon", "Haversine"],
      "detailsUrl": "#driver-order-optimizer-project",
      "onclick": "switchToTab('freelance')",
      "highlighted": true
    },
    {
      "icon": "fas fa-robot",
      "title": "RPA Automation Solutions",
      "description": "Developed comprehensive automation solutions using Python and UiPath, achieving 80% reduction in manual effort for data processing and visualization tasks.",
      "tags": ["Python", "UiPath", "VBA Excel"],
      "detailsUrl": "#rpa-automation-project",
      "onclick": "switchToTab('work')"
    },
    {
      "icon": "fas fa-globe",
      "title": "OKAS FLD Business Website",
      "description": "Modern business website built with Next.js, TypeScript, and Tailwind CSS. Features responsive design, multi-language support, and professional UI/UX.",
      "tags": ["Next.js", "TypeScript", "Tailwind CSS"],
      "liveUrl": "https://okas-fld.de/"
    },
    {
      "icon": "fas fa-heart",
      "title": "Vivantes-Humanitas Web Application",
      "description": "Django-based web application for Vivantes Humanitas e.V., enabling efficient management of volunteer registrations and activity tracking.",
      "tags": ["Django", "Python", "HTML", "CSS"],
      "liveUrl": "https://www.vivantes-humanitas.org/"
    },
    {
      "icon": "fas fa-building",
      "title": "Pentak Sarl International Website",
      "description": "Professional business website for Pentak Sarl International, featuring modern design, responsive layout, and comprehensive company information.",
      "tags": ["Laravel", "HTML", "CSS", "JavaScript"],
      "liveUrl": "https://pentak-global.com/"
    },
    {
      "icon": "fas fa-brain",
      "title": "Autonomous Drone Navigation",
      "description": "End-to-End Learning System for autonomous drone navigation using Python, TensorFlow, and AirSim simulation, achieving Level 4 navigation capabilities.",
      "tags": ["Python", "TensorFlow", "AirSim"],
      "detailsUrl": "#drone-navigation-project",
      "onclick": "switchToTab('school')"
    },
    {
      "icon": "fas fa-cogs",
      "title": "Software Architecture Tool",
      "description": "Custom software architecture tool supporting Model-Driven Architecture for automotive sector, improving development efficiency in safety-critical systems.",
      "tags": ["Java", "Eclipse", "UML"],
      "detailsUrl": "#software-architecture-project",
      "onclick": "switchToTab('school')"
    },
    {
      "icon": "fas fa-mobile-alt",
      "title": "Cross-Platform Mobile Apps",
      "description": "Full-stack, cross-platform mobile applications using TypeScript, React Native Expo, with Java Spring Boot, Python Django, and PHP Laravel backends.",
      "tags": ["React Native", "TypeScript", "Spring Boot"],
      "detailsUrl": "#csk-mobile-apps-project",
      "onclick": "switchToTab('freelance')"
    }
  ],
  "experienceTabs": [
    {
      "id": "freelance",
      "title": "Freelance Work",
      "active": true,
      "items": [
        {
          "title": "Daimon Platform - Enterprise Microservices Platform",
          "company": "StartUp initiative",
          "date": "2025",
          "projectId": "daimon-platform-project",
          "description": "Comprehensive microservices-based digital platform connecting customers with shoe repair businesses. Enterprise-grade project with 8 independent microservices, event-driven architecture, and production-ready infrastructure.",
          "achievements": [
            "Designed and implemented scalable microservices architecture with 8 independent services using domain-driven design, service mesh architecture, and database per service pattern",
            "Built event-driven communication system using RabbitMQ 3.12 message queue with Pika and Aio-pika clients for high-throughput asynchronous service communication",
            "Created unified API gateway using Nginx with routing, load balancing, SSL/TLS termination, rate limiting, and service discovery",
            "Implemented full-stack applications: Next.js 16 web dashboard with React 19, React Native 0.81 mobile app with Expo, and comprehensive RESTful API",
            "Developed 8 production-ready microservices in Python 3.x/FastAPI 0.109: User Service (JWT auth, RBAC), Order Service (lifecycle management), Payment Service (Stripe integration), Chat Service (WebSockets), Image Analysis Service (Vision AI), Analytics Service (TimescaleDB), Notification Service (multi-channel), Shipping Service (DHL/DPD)",
            "Integrated 15+ third-party services: Stripe API (payment processing), SendGrid (email delivery), Firebase Cloud Messaging (push notifications), Vision AI API (image analysis), DHL/DPD APIs (shipping), with comprehensive error handling and retry logic",
            "Set up comprehensive monitoring stack with Prometheus (metrics collection), Grafana (visualization dashboards), structured JSON logging, health checks, and Prometheus client integration",
            "Implemented Docker containerization for all 8 services with optimized Dockerfiles, Docker Compose orchestration, and production-ready deployment configuration",
            "Built CI/CD pipeline with GitLab CI including automated testing (pytest), security scanning (SAST, secret detection), Docker Compose validation, Nginx config validation, and infrastructure testing",
            "Designed multi-database strategy: PostgreSQL 16 (per service with Alembic migrations), TimescaleDB (time-series analytics), Redis 7 (caching and real-time state), with proper data isolation",
            "Implemented enterprise-grade security: JWT authentication with Python-JOSE, Bcrypt password hashing, security headers (XSS, CSRF protection), input validation with Pydantic 2.5, and secret management",
            "Created real-time chat system using WebSockets with Redis for connection management, message persistence, channel management, and reliable message delivery",
            "Developed time-series analytics service with TimescaleDB, RabbitMQ event consumption, business metrics calculation (revenue, orders, categories), data aggregation algorithms, and BI dashboards",
            "Built User Service with JWT-based authentication, role-based access control (Customer/Business/Admin), password security with Bcrypt, and comprehensive profile management",
            "Developed Payment Service with complete Stripe integration, multiple payment methods, transaction management, platform fee calculation (automated), webhook handling with retry logic, and refund management",
            "Created Image Analysis Service with AI-powered analysis using Vision AI, image processing with Pillow, automated pricing engine, secure file upload management, and confidence scoring",
            "Implemented Notification Service with multi-channel support (Email, Push, SMS), Jinja2 template engine, SendGrid integration, Firebase Cloud Messaging, event-driven triggers, and retry logic",
            "Built Shipping Service with multi-carrier integration (DHL, DPD), rate calculation algorithms, PDF label generation with ReportLab, tracking management, and address validation",
            "Developed frontend applications: Next.js 16 dashboard with TanStack Query, Recharts for data visualization, Tailwind CSS 4, and React Native mobile app with Expo Camera, Image Picker, and AsyncStorage",
            "Achieved 100% Dockerized deployment, comprehensive test coverage with pytest, type safety with TypeScript 5, and production-ready infrastructure with horizontal scaling capabilities"
          ],
          "tags": ["Python", "FastAPI", "Next.js", "React Native", "TypeScript", "PostgreSQL", "RabbitMQ", "Docker", "Microservices", "Nginx", "Prometheus", "Grafana", "Stripe", "Redis", "TimescaleDB"]
        },
        {
          "title": "LeitApp Platform - Immigration & Integration Platform",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "leitapp-platform-project",
          "description": "Enterprise-grade immigration and integration platform with 19+ microservices across multiple technology stacks. Supports immigrants in Germany with mentorship, document management, job marketplace, AI assistance, and community features.",
          "achievements": [
            "Designed and architected enterprise-grade microservices system with 19+ independent services across 4 programming languages (Python 3.11+, TypeScript/Node.js, Java, PHP) with cloud-native deployment readiness",
            "Implemented hybrid technology stack optimized per service domain: Django 4.2.7 (Python services: Voice, AI, Analytics, Document, Translation), NestJS 10.x (TypeScript services: Payment, Communication, Activity Feed, Calendar, Task, API Gateway), Spring Boot (Java services: User, Auth, Authorization), Laravel (PHP services: Content, Job Marketplace, Mentorship)",
            "Built comprehensive frontend application using Next.js 14 with React 18, TypeScript, Tailwind CSS, Radix UI components, React Query, Zustand state management, Framer Motion animations, and Playwright E2E testing",
            "Developed AI-powered services: Conversational AI with GPT-4, intelligent recommendations engine, predictive analytics with scikit-learn, document understanding with NLP (spaCy, NLTK), and natural language processing",
            "Created advanced voice processing service with Text-to-Speech (AWS Polly, Google Cloud TTS), Speech-to-Text (OpenAI Whisper), audio processing (librosa, noisereduce, pydub), FFmpeg integration, and multi-language voice support",
            "Implemented multi-provider payment gateway with Stripe (credit/debit cards, Apple Pay, Google Pay), PayPal, Revolut, and Wise, including subscription management with proration, ZUGFeRD-compliant invoice generation, webhook processing with retry logic, and fraud detection",
            "Built real-time communication system using WebSockets: Django Channels (Python), Socket.io (Node.js), video call integration, notification system, message history and search, and live updates",
            "Designed secure document management system with AWS S3 storage, AI-powered document extraction, multi-language translation support (7 languages), secure file handling, and document processing pipelines",
            "Implemented comprehensive translation services supporting 7 languages: German, English, Arabic, Turkish, Spanish, French, Polish with dynamic content localization and RTL support",
            "Created comprehensive API Gateway for centralized routing, authentication, service orchestration, load balancing, and request/response transformation with 200+ API endpoints",
            "Set up event-driven architecture with message queues: Celery (Python async tasks), Bull Queue (Node.js job processing), RabbitMQ/Kafka (message broker) for asynchronous processing and scalability",
            "Implemented enterprise-grade security: JWT authentication across all services, GDPR/DSGVO compliance, PCI DSS considerations for payment processing, role-based access control, and comprehensive security architecture",
            "Completed 3 complete SDLC phases: Phase 1 (Planning & Requirements Analysis), Phase 2 (Requirements Definition with 13 functional and 6 non-functional requirements), Phase 3 (Design & Architecture with complete technical design)",
            "Achieved 100% requirements traceability from business needs to implementation with comprehensive documentation (50+ technical documents), Architecture Decision Records (ADRs), test strategy (unit, integration, E2E, performance, security), and quality assurance processes",
            "Built Payment Service (NestJS) with multi-provider processing, subscription management, ZUGFeRD invoicing, webhook handling, and fraud detection",
            "Developed Voice Service (Django) with AWS Polly and Google TTS integration, OpenAI Whisper for speech-to-text, audio processing and enhancement, real-time WebSocket updates, and multi-language support",
            "Created AI Service (Django) with GPT-4 conversational AI, recommendations engine, predictive analytics, document understanding, and NLP capabilities",
            "Implemented Communication Service (NestJS) with real-time messaging via WebSockets, video call integration, notification system, and message history",
            "Designed database architecture with PostgreSQL 15+ (primary), Redis 7+ (caching and sessions), AWS S3 (file storage), with 100+ database tables and optimized query performance",
            "Established development environment with code quality tools (ESLint, Prettier, Black, Flake8, MyPy), testing frameworks (Jest, Pytest, Playwright), API documentation (OpenAPI/Swagger), and Docker containerization"
          ],
          "tags": ["Python", "Django", "NestJS", "Spring Boot", "Laravel", "Next.js", "TypeScript", "PostgreSQL", "Redis", "AWS", "Docker", "Microservices", "AI/ML", "OpenAI", "Stripe", "WebSockets"]
        },
        {
          "title": "Multipurpose Service Website - Cross-Platform Application",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "multipurpose-service-website-project",
          "description": "Production-ready, full-stack cross-platform application (iOS, Android, Web) with CMS, contact forms, GDPR compliance, and administrative controls. Single codebase supporting multiple platforms.",
          "achievements": [
            "Developed production-ready cross-platform application using React Native 0.81.5 with Expo 54.0.0, supporting iOS, Android, and Web from single codebase with native performance and platform-specific optimizations",
            "Built comprehensive Content Management System (CMS) with database-driven content stored in SQLite, full admin interface with CRUD operations, service management (Household & Office categories), page content management, settings management, and contact information management",
            "Implemented RESTful API backend using Express.js 4.21.1 with SQLite3 5.1.7 database, parameterized queries for SQL injection prevention, custom database abstraction layer, indexed queries for performance, and transaction support",
            "Created enterprise-grade contact form system with comprehensive validation (Express Validator 7.2.0 for server-side, client-side validation), GDPR/DSGVO compliance with explicit privacy consent checkbox, email integration via Nodemailer 6.9.16 with SMTP, HTML email templates, and database logging",
            "Designed complete GDPR/DSGVO-compliant legal pages including comprehensive Privacy Policy, Impressum (German TMG requirements), privacy consent component integration, structured legal content presentation, and privacy-first approach without cookie tracking",
            "Implemented secure file upload system with Multer 1.4.5 for multipart/form-data handling, image validation (JPEG, PNG, GIF, WebP) with MIME type checking, 5MB size limits, unique filename generation, organized file storage, and database metadata tracking",
            "Built responsive design system with mobile-first approach, custom responsive utilities with useResponsive hook, enterprise design tokens (colors, typography, spacing), breakpoint system (sm: 640px, md: 768px, lg: 1024px, xl: 1280px), and safe area handling for notched devices",
            "Developed navigation system using Expo Router 6.0.15 with file-based routing, deep linking support via expo-linking 7.0.3, custom header components, and platform-specific navigation patterns",
            "Implemented authentication system with bcrypt 5.1.1 password hashing, secure session management, admin access control, role-based permissions, and protected admin routes",
            "Created comprehensive database architecture with well-structured normalized schema: Services, Page Content, Contact Info, Settings, Media, Admin Users with proper relationships, indexed queries, and database initialization scripts",
            "Set up professional development environment with TypeScript 5.9.2 strict mode, Nodemon 3.1.9 for auto-restart, Concurrently 8.2.2 for multiple processes, environment variable management with dotenv, and modular file structure",
            "Implemented comprehensive form validation using Express Validator 7.2.0 with input sanitization, XSS protection, SQL injection prevention, email validation, phone format checking, message length limits, and user-friendly error messages",
            "Integrated additional features: expo-location 19.0.7 for location services, expo-web-browser 15.0.9 for in-app browser, CORS 2.8.5 configuration, and body parser 1.20.3 middleware"
          ],
          "tags": ["React Native", "Expo", "TypeScript", "Express.js", "SQLite", "Node.js", "Cross-Platform", "CMS", "GDPR", "Multer", "bcrypt", "Nodemailer"]
        },
        {
          "title": "Logistics Marketplace MVP - Full-Stack Platform",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "logistics-marketplace-project",
          "description": "Full-stack multilingual logistics marketplace platform connecting shippers with service providers (freelancers and small logistics companies). Features three-role system with shipment management, provider matching, booking, payment processing, and messaging.",
          "achievements": [
            "Developed full-stack TypeScript 5.1.3 application with NestJS 10.0.0 backend and React Native 0.81.5 frontend, ensuring 100% type safety across entire stack with zero runtime type errors",
            "Implemented comprehensive multi-role system with Role-Based Access Control (RBAC): Shipper, Provider, and Admin roles with JWT authentication using Passport.js, custom guards, decorators, and role-specific dashboards",
            "Built advanced provider matching algorithm with intelligent matching based on service areas, capacity filtering (weight, vehicle type), availability status checking, and 4 different rate calculation methods (per km, per shipment, weight-based, flat rate) with real-time cost estimation",
            "Created comprehensive booking and payment system with automated booking creation, intelligent provider selection, 15% platform commission calculation (automated), multiple payment methods (card, mobile wallet, cash), provider earnings tracking, and complete payment history",
            "Implemented complete multilingual support for 3 languages (English, Arabic, Kurdish) with full RTL layout support using i18next 23.7.0, automatic locale detection from device settings, language switching with persistent preferences, and all 24+ screens fully internationalized",
            "Designed modular backend architecture with 9 feature modules: Auth, Users, Providers, Shipments, Bookings, Payments, Ratings, Messages, Admin with service layer pattern, dependency injection, and repository pattern using TypeORM",
            "Built 7 normalized database entities with TypeORM 0.3.17: User, Provider, Shipment, Booking, Payment, Rating, Message with proper One-to-Many and Many-to-One relationships, automatic migration support, and database seeding script",
            "Developed 30+ REST API endpoints with RESTful design, proper HTTP methods (GET, POST, PUT, DELETE), service layer pattern, dependency injection, error handling, and comprehensive request validation with class-validator",
            "Created cross-platform mobile application with 24+ screens across all user roles, platform-specific optimizations (iOS, Android, Web), native navigation patterns (Stack, Tabs), responsive design with safe area handling, and React Native Reanimated animations",
            "Implemented real-time features: shipment status tracking with location updates, in-app messaging system between users, live booking status updates, real-time provider availability management, and WebSocket integration",
            "Built comprehensive admin dashboard with statistics, user management and verification system, provider verification workflow, commission tracking and reporting, booking and payment analytics, and dispute management interface",
            "Designed database with normalized entities, TypeORM decorators for schema definition, proper relationships, automatic migration support, database seeding with dummy data, and transaction handling",
            "Implemented authentication system with Passport.js JWT strategy, bcrypt 5.1.1 password hashing, token storage and refresh strategies, secure API communication, and route guards",
            "Developed state management with React Context API for global state, Axios 1.6.0 with interceptors for API calls, AsyncStorage 2.2.0 for persistent local storage, and custom hooks for reusable logic",
            "Created form handling and validation with comprehensive client and server-side validation, error handling patterns, loading states, and user feedback mechanisms"
          ],
          "tags": ["NestJS", "React Native", "TypeScript", "SQLite", "TypeORM", "i18n", "JWT", "Expo", "Passport.js", "bcrypt", "Axios", "AsyncStorage"]
        },
        {
          "title": "Multipurpose Website - E-Commerce Platform",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "multipurpose-website-project",
          "description": "Production-ready, full-stack web application with e-commerce functionality, content management, user authentication, and administrative controls. Built with Next.js 14, TypeScript, Prisma, and NextAuth.js.",
          "achievements": [
            "Developed production-ready full-stack web application using Next.js 14 (App Router) with TypeScript 5.5, React 18.3, server-side rendering, API routes, and optimized performance",
            "Implemented comprehensive e-commerce functionality: shopping cart with Zustand state management and localStorage persistence, product catalog with advanced filtering, complete order management system, inventory tracking, price calculations, and totals management",
            "Built enterprise-grade user authentication system with NextAuth.js 4.24, JWT-based sessions with custom callbacks, role-based access control (User/Admin), protected routes with middleware, secure password storage with bcryptjs (10 rounds), and custom login/register pages",
            "Created comprehensive admin Content Management System (CMS) with real-time statistics dashboard, product management with full CRUD operations, contact message management interface, user management capabilities, role-based admin access control, and optimistic UI updates",
            "Designed robust database architecture using Prisma 5.19 ORM with SQLite (PostgreSQL-ready for production): User, Product, Order, Cart, ContactMessage, Page, Session, Account models with proper relationships, type-safe queries, and database migrations",
            "Implemented advanced state management with Zustand 4.5 including localStorage persistence middleware, optimistic UI updates, type-safe cart operations, and efficient re-render optimization",
            "Built comprehensive form handling system with React Hook Form 7.52 and Zod 3.23 validation for contact forms, product management, user registration, server-side validation, and user-friendly error messages",
            "Developed responsive design with Tailwind CSS 3.4, mobile-first approach, modern UI components with Lucide React icons, accessible design patterns, and custom reusable component library",
            "Implemented enterprise-grade security features: password hashing with bcryptjs (10 rounds), SQL injection prevention via Prisma ORM, XSS protection, CSRF protection, input validation with Zod, and security headers",
            "Created RESTful API routes with proper error handling patterns, request validation, appropriate HTTP status codes (200, 400, 500), JSON response formatting, and comprehensive error messages",
            "Set up professional development environment with TypeScript strict mode, ESLint configuration, path aliases (@/*), production-ready build configuration, and code quality tools",
            "Implemented additional features: react-hot-toast for user-friendly notifications, clsx and tailwind-merge for conditional styling, and comprehensive error boundaries"
          ],
          "tags": ["Next.js", "TypeScript", "Prisma", "NextAuth.js", "Zustand", "Tailwind CSS", "E-commerce", "React Hook Form", "Zod", "bcryptjs", "JWT"]
        },
        {
          "title": "E-Commerce Dropshipping Platform - Full-Stack AI-Powered Platform",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "ecommerce-dropshipping-project",
          "description": "Full-stack e-commerce dropshipping platform with AI-powered search, conversational commerce, Stripe payments, returns management, shipping provider integration (USPS), and supplier/dropshipping APIs (e.g. AliExpress). Production-ready with PWA support, Docker containerization, and optional Prometheus/Grafana monitoring.",
          "achievements": [
            "Developed production-ready full-stack e-commerce platform using Next.js 16.1.1 (App Router) with React 19.2.3, TypeScript 5, Turbopack, and standalone output for optimized deployment",
            "Implemented AI-powered semantic search via OpenAI: analyzeSearchIntent with entities and filters, fallback to text search when API unavailable, paginated product results with PostgreSQL",
            "Built personalized recommendations API and UI (AI/behavior-driven) and OpenAI-based conversational chatbot for storefront support",
            "Created multi-step checkout flow: shipping form, payment via Stripe Payment Intents and Elements, order review, success page with PCI-aware handling",
            "Integrated Stripe server-side: create-intent API, webhook for payment events, client-side Stripe.js and @stripe/react-stripe-js",
            "Implemented returns and refunds: returns API (create, list, get by ID), return request flow and return-details UI",
            "Built pluggable shipping architecture: base provider, manager, USPS provider; rate and admin provider APIs",
            "Designed dropshipping/supplier integration: base supplier, supplier manager, AliExpress-like supplier implementation; admin supplier CRUD and sync API",
            "Developed order lifecycle with shipping label/tracking APIs and dropship API for supplier fulfillment",
            "Implemented JWT-based auth (login, register, me) with bcryptjs and role-based access (customer, admin)",
            "Built admin dashboard: layout, sidebar, header; pages for products, shipping providers, suppliers",
            "Created product catalog with full CRUD, categories, variants, images, featured products, search API with pagination",
            "Implemented persistent cart API (get, add, update, remove) and cart UI (dropdown, summary, items) with Zustand state management",
            "Added PWA support: manifest.json, service worker (sw.js) for caching static/dynamic and API patterns; PWA provider component",
            "Built analytics: events API and client-side analytics hook for behavior tracking",
            "Implemented rate limiting utility (in-memory; production path for Redis) and /api/health for DB connectivity and monitoring",
            "Set up Docker multi-stage build (deps, builder, runner), Docker Compose (app, PostgreSQL 16, Redis 7, nginx, prometheus, grafana), deploy.sh for backup/deploy/rollback",
            "Implemented Jest for unit/component tests and Playwright E2E for homepage, products, cart-checkout across Chromium, Firefox, WebKit, and mobile",
            "Designed PostgreSQL schema (users, products, categories, orders, cart, returns, analytics), connection pooling, migrations via schema.sql",
            "Used Zustand for client state (auth, cart, products) and TanStack React Query for server state and caching",
            "Built responsive UI with Tailwind CSS 4, Radix UI, Headless UI, Framer Motion, cva for component variants, and Lucide/Heroicons"
          ],
          "tags": ["Next.js", "React 19", "TypeScript", "PostgreSQL", "Redis", "Stripe", "OpenAI", "Docker", "PWA", "Jest", "Playwright", "Zustand", "TanStack Query", "Tailwind CSS", "Radix UI"]
        },
        {
          "title": "Web & Mobile Platform - Corporate Website",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "web-mobile-platform-project",
          "description": "Enterprise-grade corporate website with full legal compliance (DSG - Swiss Data Protection Act), responsive design, and advanced UX features. Built with Next.js 14, TypeScript, and modern web standards.",
          "achievements": [
            "Developed enterprise-grade corporate website using Next.js 14.0.4 (App Router) with TypeScript 5.3.3, React 18.2.0, server-side rendering, React Server Components, and optimized performance",
            "Implemented comprehensive DSG-compliant cookie management system with granular consent management (Necessary, Analytics, Marketing categories), 365-day cookie preference persistence, dynamic script loading based on user consent, custom event system for consent updates, and full compliance with Swiss Data Protection Act (DSG)",
            "Created complete legal documentation: comprehensive Impressum (legal notice) per DSG Art. 6 Abs. 1, detailed privacy policy (Datenschutzerklärung), GDPR/DSG-compliant data handling, and structured legal content presentation",
            "Built performance-optimized application with React Server Components for reduced JavaScript bundle, SWC minification enabled, optimized build configuration, dynamic meta tags for SEO, semantic HTML structure, and fast initial page loads",
            "Developed fully responsive design with mobile-first approach, smooth scroll animations using Intersection Observer API, accessible navigation with ARIA labels, keyboard navigation support, and optimized for Desktop, Tablet, and Mobile",
            "Implemented modern UI/UX with professional design system, CSS Variables for centralized theme system (colors, spacing, typography), consistent spacing and typography, interactive forms with validation, and user feedback mechanisms",
            "Created reusable component architecture: Header, Footer, CookieBanner, AnimateOnScroll components with modularity, clean code structure, component composition, and separation of concerns",
            "Built multi-page website: Homepage with hero section and features, Products page, About Us, Contact with form validation, Impressum, Privacy Policy with semantic HTML5 structure and proper heading hierarchy",
            "Designed advanced CSS architecture with centralized design tokens (colors, spacing, typography, shadows, border radius), CSS Grid and Flexbox layouts, modern CSS animations and transitions, gradient backgrounds, and visual effects",
            "Implemented robust error handling with cookie parsing, consent management, user-friendly error messages, try-catch patterns, and graceful degradation",
            "Set up professional development environment with TypeScript strict mode, ESLint 8.56.0 with Next.js ESLint config, Git version control, production build optimization, and comprehensive documentation",
            "Integrated browser APIs: Intersection Observer API for scroll-triggered animations, Document Cookie API for cookie management and parsing, Custom Events API for event-driven architecture, and Local Storage concepts"
          ],
          "tags": ["Next.js", "TypeScript", "React", "CSS3", "DSG Compliance", "SEO", "Intersection Observer", "Server Components", "ESLint"]
        },
        {
          "title": "Women's Health NGO Website - Full-Stack Application",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "breast-cancer-ngo-website-project",
          "description": "Production-ready, full-stack web application for a Women's Health NGO focused on breast cancer awareness in Adare, Ireland. Features complete content management system, interactive forms, dynamic routing, and enterprise-grade architecture.",
          "achievements": [
            "Developed production-ready full-stack web application using Next.js 14.2.33 (App Router) with TypeScript 5.3.3, React 18.2.0, server-side rendering, static site generation, automatic code splitting, and image optimization",
            "Built comprehensive multi-page website architecture with 8+ pages: Home with hero section, Mission, Initiatives, Events with event listings, Blog System with dynamic posts, Donate with payment integration, Volunteer with application form, Contact with form validation, all with dynamic routing and SEO optimization",
            "Created enterprise-grade blog system with dynamic blog post pages using [slug] routing, category-based organization, date formatting with date-fns 2.30.0, SEO-friendly URL structure, individual post pages, and blog listing with filtering",
            "Implemented advanced form systems: Donation form with preset amounts, custom amount input, anonymous donation option, payment method selection; Volunteer application with multi-field collection, interest selection, availability dropdown, comprehensive validation, and database persistence",
            "Developed 3 fully implemented API endpoints: /api/contact, /api/donate, /api/volunteer with comprehensive request validation, error handling, proper HTTP status codes (200, 400, 500), JSON response formatting, async/await patterns, and ready for third-party payment integrations",
            "Built responsive navigation with desktop horizontal menu, mobile hamburger menu with animations, sticky navigation bar, smooth transitions, accessibility attributes (ARIA labels), keyboard navigation support, and focus indicators",
            "Implemented comprehensive form management with React Hook Form 7.49.2, advanced validation, error handling with user-friendly messages, loading states during submission, success feedback with visual indicators, auto-reset functionality, and form state management",
            "Created custom Tailwind CSS 3.4.0 configuration with primary/accent color palettes, custom font families, reusable component classes, typography scales, consistent spacing system, CSS layer architecture (@layer base, components, utilities), and PostCSS 8.4.32 processing",
            "Designed comprehensive user experience features: loading states for form submissions, success messages with visual feedback, comprehensive error handling, smooth scroll behavior, hover effects, micro-interactions, and responsive design patterns",
            "Implemented robust error handling: custom 404 page, API error responses with proper status codes, form validation errors with field-specific messages, user-friendly error messages, try-catch patterns, and graceful error recovery",
            "Set up professional development environment with TypeScript strict mode, ESLint 8.56.0 with Next.js ESLint config, Autoprefixer 10.4.16, production-ready build configuration, and code quality tools",
            "Ensured full accessibility (WCAG AA compliance): ARIA labels and roles, semantic HTML5 structure, keyboard navigation support, focus indicators, screen reader compatibility, proper heading hierarchy, and accessible form labels"
          ],
          "tags": ["Next.js", "TypeScript", "React Hook Form", "Tailwind CSS", "API Routes", "date-fns", "SEO", "Accessibility", "WCAG"]
        },
        {
          "title": "Composer Portfolio Website - Multilingual Platform",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "composer-website-project",
          "description": "Modern, multilingual portfolio website for a classical composer with internationalization (i18n), interactive music player, works catalog with filtering, and responsive design. Built with Next.js 14 and TypeScript.",
          "achievements": [
            "Developed modern multilingual portfolio website using Next.js 14.2.0 (App Router) with TypeScript 5.3.3, React 18.3.0, full internationalization support, and production-ready architecture",
            "Implemented complete internationalization (i18n) with next-intl 3.26.5, bilingual support (German/English), middleware-based locale routing and detection, dynamic content localization, language switcher with smooth transitions, and 11+ pages fully internationalized",
            "Built advanced interactive music player component with custom audio player using React hooks (useState, useEffect, useRef), comprehensive playlist management, progress tracking and seeking functionality, volume control and mute, auto-play capabilities, track navigation, and responsive design",
            "Created comprehensive works catalog system with dynamic filtering by category (8+ categories: Orchestral, Chamber, Solo, Vocal, etc.), real-time search across titles/descriptions/instrumentation, memoized filtering with useMemo for performance, category-based navigation, and individual work detail pages with dynamic routing",
            "Developed 11+ fully functional pages: Biography, Works with catalog, News, Discography, Press, Media, Contact, Listen with music player, Scores, Versus Vox, with dynamic routing, static generation using generateStaticParams, and optimized routing",
            "Implemented advanced Next.js App Router architecture with dynamic routes ([locale], [id]), server and client components optimization, static site generation (SSG), metadata API for SEO, and optimized routing patterns",
            "Built responsive and accessible design with mobile-first layout, ARIA labels and roles, semantic HTML structure, keyboard navigation support, custom scrollbar styling, focus indicators, and screen reader compatibility",
            "Created modern UI/UX features: smooth page transitions with Framer Motion 11.0.0, animated navigation indicators, backdrop blur effects, gradient backgrounds, hover states and micro-interactions, mobile hamburger menu with animations, and modern design patterns",
            "Implemented comprehensive performance optimizations: Next.js image optimization, code splitting and lazy loading, optimized bundle size, efficient re-renders with React hooks (useMemo, useCallback), and production build optimization",
            "Designed type-safe development with TypeScript interfaces for all data structures, strict type checking enabled, type-safe component props, centralized type definitions, generic types, and type inference",
            "Set up professional development environment with TypeScript strict mode, ESLint 8.56.0 with Next.js ESLint config, modern build optimization, PostCSS 8.4.33, Autoprefixer 10.4.17, and code quality tools",
            "Created comprehensive custom design system with Tailwind CSS 3.4.1, custom theme configuration, primary/accent color palette, typography scales, animations, CSS Grid and Flexbox layouts, and consistent design tokens",
            "Integrated additional libraries: Lucide React 0.344.0 for icons, clsx 2.1.0 for conditional classes, tailwind-merge 2.2.0 for class merging, and date-fns for date manipulation"
          ],
          "tags": ["Next.js", "TypeScript", "next-intl", "Framer Motion", "Tailwind CSS", "i18n", "React Hooks", "Audio API", "SEO"]
        },
        {
          "title": "Driver Order Optimizer - Vehicle Driver Planning System",
          "company": "Own Initiative",
          "date": "2025",
          "projectId": "driver-order-optimizer-project",
          "description": "Full-stack application for optimizing order management and daily planning for vehicle drivers (Fahrzeugüberführer). The system integrates with Google Maps API for routing calculations and provides an interactive dashboard for plan visualization, route planning, and order management.",
          "achievements": [
            "Designed and developed a full-stack application using Next.js (App Router) and Express.js with TypeScript for type-safe development across frontend and backend",
            "Implemented RESTful API endpoints for order management and interactive plan building with route calculations and travel segment estimates",
            "Built Material UI dashboard with Next.js for interactive visualization of plans, order management, route calculations, and plan storage with level-based organization",
            "Integrated Google Maps API (Routes API, Distance Matrix, Geocoding) for driving and transit route calculations with intelligent caching and address normalization",
            "Created interactive plan builder with level-based plan generation, allowing drivers to manually select orders, calculate routes, manage transitions between orders, and save multiple plan configurations",
            "Designed plan store service for saving and loading multiple plan configurations with JSON persistence",
            "Set up comprehensive development environment using VS Code Dev Containers (.devcontainer) for consistent development experience across team members",
            "Implemented Zod schema validation for all API endpoints ensuring type safety and request validation",
            "Built geocoding service with persistent caching and Haversine distance calculations for spatial optimizations",
            "Developed transition routing system supporting both driving and train/transit modes with real-time schedule integration"
          ],
          "tags": ["Next.js", "Express.js", "TypeScript", "JavaScript", "Material UI", "Docker", "Dev Containers", "Node.js", "React", "REST API", "Google Maps API", "Zod", "Luxon", "Haversine"]
        },
        {
          "title": "OKAS FLD - Drive & Delivery Services",
          "company": "Business Website Project",
          "date": "2025",
          "projectId": "okas-fld-project",
          "description": "Modern business website for OKAS FLD (drive & delivery services). Built with Next.js (App Router), TypeScript, and Tailwind; responsive, SEO‑optimized, and i18n (DE/EN/FR). Deployed from GitHub to Render.com with a custom domain via AWS Route 53.",
          "achievements": [
            "Developed responsive web app using Next.js with TypeScript",
            "Implemented multi-language support with i18n",
            "Created mobile-first design with Tailwind CSS and custom components",
            "Implemented modern development practices and architecture",
            "Handled full-stack deployment and DevOps workflows",
            "Deployed via GitHub → Docker Hub → Render.com with AWS Route 53 DNS management"
          ],
          "tags": ["Next.js", "React", "TypeScript", "Tailwind CSS", "GitHub", "Render.com", "AWS Route 53"]
        },
        {
          "title": "ASOK-SE - Enterprise Web Application",
          "company": "ASOK-SE SARL",
          "date": "2024",
          "projectId": "asok-se-project",
          "description": "Comprehensive web application aimed at enhancing enterprise advertisement. Integrated multiple technologies to provide a seamless user experience for businesses to promote their products and services.",
          "achievements": [
            "Developed and optimized front-end components using HTML and CSS, ensuring cross-browser compatibility and responsiveness",
            "Built robust backend services with Python/Django, handling business logic, data storage, retrieval, and processing efficiently",
            "Utilized Docker for containerization, facilitating easy deployment and scalability of the application",
            "Incorporated JavaScript for dynamic content updates and enhanced user interaction"
          ],
          "tags": ["HTML", "CSS", "JavaScript", "Docker", "GitHub", "Python", "Django"]
        },
        {
          "title": "Local Jenkins Container in VS Code Dev Container",
          "company": "Private Project",
          "date": "2024",
          "projectId": "jenkins-container-project",
          "description": "Professional CI/CD development environment with Jenkins configured for Django projects using VS Code Dev Containers. This setup provides a fully configured Jenkins environment with Docker support.",
          "achievements": [
            "Containerized Jenkins environment with Docker-in-Docker support",
            "Complete Python/Django development tooling",
            "Built-in security scanning (Trivy, Bandit)",
            "Integrated testing suite (pytest, pytest-django, pytest-cov)",
            "Code quality tools (flake8, black, isort)",
            "Professional template for Automated CI/CD pipeline",
            "VS Code integration with essential extensions"
          ],
          "tags": ["Jenkins", "Docker", "VS Code", "Python", "Django", "CI/CD", "DevOps"]
        },
        {
          "title": "Vivantes Humanitas Web Application",
          "company": "Friend's Project",
          "date": "2023 - 2024",
          "projectId": "vivantes-humanitas-project",
          "description": "Django-based web application for Vivantes Humanitas e.V., enabling efficient management of volunteer registrations and activity tracking.",
          "achievements": [
            "Developed a Django-based web application for Vivantes Humanitas e.V., enabling efficient management of volunteer registrations and activity tracking",
            "Built a responsive frontend using HTML, CSS, and JavaScript, ensuring an intuitive and user-friendly interface",
            "Designed a secure backend with Django and Python, ensuring data integrity and compliance with privacy regulations"
          ],
          "tags": ["Python", "Django", "HTML", "CSS", "JavaScript"]
        },
        {
          "title": "Pentak SARL International - Enterprise Web Application",
          "company": "Pentak SARL International",
          "date": "2021 - 2022",
          "projectId": "pentak-sarl-project",
          "description": "Web application using Laravel/Lumen to manage business operations for a friend's company.",
          "achievements": [
            "Created a web application using Laravel/Lumen to manage business operations for a friend's company",
            "Implemented a user interface with PHP, PHP-Blade, HTML, CSS, and JavaScript"
          ],
          "tags": ["PHP", "Laravel", "Lumen", "PHP-Blade", "HTML", "CSS", "JavaScript"]
        },
        {
          "title": "Offer Comparison Web Application",
          "company": "Own Initiative",
          "date": "2020 - 2021",
          "projectId": "offer-comparison-project",
          "description": "Laravel/Lumen-based application to compare online offers, allowing users to make informed purchasing decisions.",
          "achievements": [
            "Designed and developed a Laravel/Lumen-based application to compare online offers, allowing users to make informed purchasing decisions",
            "Integrated secure user authentication with Laravel/Passport, ensuring data privacy and secure access",
            "Utilized SQLite and Eloquent ORM for efficient database management and dynamic data presentation"
          ],
          "tags": ["PHP", "Laravel", "Lumen", "HTML", "CSS", "JavaScript", "Git", "GitHub", "SQLite"]
        },
        {
          "title": "Restaurant Management Application",
          "company": "Initiative with Friends",
          "date": "2019 - 2020",
          "projectId": "restaurant-management-project",
          "description": "Laravel/Lumen-based system to streamline restaurant operations, including inventory tracking and order management.",
          "achievements": [
            "Built a Laravel/Lumen-based system to streamline restaurant operations, including inventory tracking and order management",
            "Collaborated remotely using Zoom and managed code versions with Git/GitHub"
          ],
          "tags": ["PHP", "PHP-Blade", "Framework", "Git", "GitHub", "Zoom"]
        },
        {
          "title": "Hairstyle Business Web Application",
          "company": "Initiative with Friends",
          "date": "2018 - 2019",
          "projectId": "hairstyle-business-project",
          "description": "Express.js web application to support a friend's hairstyle business by enabling appointment booking and customer management.",
          "achievements": [
            "Developed an Express.js web application to support a friend's hairstyle business by enabling appointment booking and customer management",
            "Created a responsive frontend with HTML, CSS, and JavaScript, ensuring compatibility across devices"
          ],
          "tags": ["Express.js", "HTML-TWIG", "Framework", "MySQL", "npm", "ngrok", "Git", "nodemon", "babel-node.js"]
        },
        {
          "title": "CSK Student Association Web Application",
          "company": "Own Initiative",
          "date": "2016 - 2017",
          "projectId": "csk-mobile-apps-project",
          "description": "Web application for the CSK student group at TU Clausthal, facilitating event management and communication among members.",
          "achievements": [
            "Led the development of a web application for the CSK student group at TU Clausthal, facilitating event management and communication among members",
            "Designed a cross-platform solution using Node.js, TypeScript, and Ionic Cordova for enhanced accessibility"
          ],
          "tags": ["Node.js", "TypeScript", "HTML", "CSS", "Ionic Cordova", "Git"]
        },
        {
          "title": "Private Tutoring in Computer Science",
          "company": "Own Initiative",
          "date": "2014 - Present",
          "projectId": "private-tutoring-project",
          "description": "Conducted private tutoring sessions to help students master programming languages and databases, focusing on practical problem-solving and real-world application.",
          "achievements": [
            "Conducted private tutoring sessions to help students master programming languages like Java, C++, PHP, and Python, as well as databases such as SQL and NoSQL (Neo4j, ArangoDB)",
            "Focused on practical problem-solving and real-world application of frameworks and tools to strengthen students' skills and confidence"
          ],
          "tags": ["Java", "C++", "PHP", "Python", "SQL", "NoSQL", "Neo4j", "ArangoDB"]
        }
      ]
    },
    {
      "id": "work",
      "title": "Professional Work",
      "active": false,
      "items": [
        {
          "title": "IT Consultant - Vehicle Technology & Planning",
          "company": "DB Regio AG",
          "date": "August 2023 - Present",
          "projectId": "rpa-automation-project",
          "achievements": [
            "Developed automation solutions using Python and UiPath, achieving 80% reduction in manual effort with a goal to reach 99% automation",
            "Built and deployed RPA robots using UiPath Orchestrator, enabling seamless task automation and improving team productivity",
            "Collaborated with cross-functional teams to design and implement robust software solutions, improving system efficiency and client satisfaction",
            "Utilized Agile (SCRUM) to manage and deliver projects on time, ensuring continuous improvement and client alignment",
            "Employed version control with Git and GitLab, ensuring smooth collaboration and code integrity",
            "Leveraged VBA (Visual Basic for Applications) to automate complex and time-consuming Excel processes, significantly improving efficiency and accuracy"
          ],
          "tags": ["Python", "UiPath", "RPA", "VBA Excel", "Git", "GitLab", "Agile", "SCRUM"]
        },
        {
          "title": "Software Developer",
          "company": "Achelos GmbH",
          "date": "August 2021 - August 2023",
          "projectId": "achelos-software-developer",
          "achievements": [
            "Developed tools in Java and C++ to manage virtual machine connections, automating configuration, file upload, and data processing tasks",
            "Integrated JUnit for unit and integration testing, improving code quality and reducing bugs in production",
            "Collaborated in an Agile environment, using JIRA for issue tracking and sprint planning to meet project deadlines efficiently",
            "Streamlined development workflows with Jenkins and Maven for automated build, testing, deployment, and CI/CD pipelines",
            "Managed package dependencies using Maven-Nexus for efficient artifact storage and distribution",
            "Utilized Git and GitLab for version control and source code management, with occasional use of Sourcetree for enhanced git workflow visualization",
            "Proficient in VS Code and Eclipse for efficient coding, debugging, and project management across various programming languages",
            "Fostered team communication and collaboration through MS Teams, ensuring smooth project communication and coordination"
          ],
          "tags": ["Java", "C++", "Spring Boot", "JUnit", "Jenkins", "Maven", "Git", "JIRA"]
        },
        {
          "title": "RPA Developer",
          "company": "DB Regio AG",
          "date": "August 2021 - June 2022",
          "projectId": "db-regio-rpa-developer",
          "achievements": [
            "Automated data processing tasks using Python and VBA Excel, cutting processing time by at least 30%",
            "Developed and deployed RPA robots with UiPath, streamlining business workflows and improving task accuracy and efficiency",
            "Worked with Agile methodologies (SCRUM) to manage automation tasks, ensuring timely delivery and client satisfaction",
            "Collaborated remotely with teams via MS Teams and GitLab to ensure smooth communication and version control"
          ],
          "tags": ["Python", "VBA Excel", "UiPath", "RPA", "Agile", "SCRUM"]
        },
        {
          "title": "Working Student - Software Developer",
          "company": "Eves-IT",
          "date": "June 2018 - February 2021",
          "projectId": "eves-it-software-developer",
          "achievements": [
            "Developed tools in Java, Spring MVC, Spring Boot and JavaFX, optimizing internal processes for automotive clients such as Volkswagen AG",
            "Created database solutions with Oracle SQL and Flyway for seamless data management across multiple systems",
            "Implemented automated testing frameworks using JUnit and TDD principles, significantly reducing bugs before and after deployment",
            "Collaborated in an Agile environment, managing development cycles using JIRA for task tracking, Bitbucket for source control management, Bamboo for CI/CD, SonarQube for QA, Miro for digital team kanban board, Zoom and MS Teams for remote collaboration",
            "Used Confluence for documentation, ensuring that all project details were clearly documented and easily accessible to the entire team",
            "Managed project dependencies and packages using Maven Artifactory, ensuring smooth version control and efficient package distribution",
            "Leveraged IntelliJ IDEA and Eclipse as integrated development environments (IDE) to improve code quality and development speed",
            "Optimized client workflows by delivering customized software solutions on time, significantly improving operational efficiency"
          ],
          "tags": ["Java", "Spring Boot", "Spring MVC", "JavaFX", "Oracle SQL", "JUnit", "JIRA", "Bamboo"]
        }
      ]
    },
    {
      "id": "school",
      "title": "Academic Work",
      "active": false,
      "items": [
        {
          "title": "Master's Thesis: End-to-End Learning System for Autonomous Drone Navigation",
          "company": "Technical University of Clausthal",
          "date": "2018 - 2024",
          "projectId": "drone-navigation-project",
          "supervisors": "Prof. Dr. Andreas Rausch, Dr. Adina Aniculaesei",
          "description": "This project aimed to revolutionize autonomous drone flight by implementing a cutting-edge end-to-end (E2E) learning approach. Conducted within the AirSim simulation environment, the work achieved Level 4 autonomous navigation capabilities, integrating advanced spatial awareness, core navigation, and expanded features such as non-planar flight paths.",
          "achievements": [
            "Designed and implemented an autonomous drone navigation system using Python, TensorFlow, and AirSim simulation",
            "Achieved level-4 navigation capabilities, including spatial awareness and non-planar movement",
            "Delivered a scalable and efficient solution for drone navigation",
            "Unlike traditional modular methods, the E2E system directly learns the mapping between inputs and outputs, enabling seamless and efficient navigation in complex environments",
            "This innovative approach highlights a significant leap in autonomous aerial systems, setting the foundation for smarter and more adaptive drone technologies"
          ],
          "tags": ["Python", "TensorFlow", "Keras", "AirSim", "Pandas", "Scikit-learn", "Git", "GitLab", "Machine Learning", "Autonomous Systems"]
        },
        {
          "title": "Master's Project: Safeguarding Safety-Critical Systems",
          "company": "Technical University of Clausthal",
          "date": "2018 - 2024",
          "projectId": "safety-critical-systems-project",
          "supervisors": "Prof. Dr. Andreas Rausch, Dr. Adina Aniculaesei",
          "description": "This project focused on analyzing safety-critical systems, with a particular emphasis on drones. As inherently safety-critical systems, drone development demands adherence to specialized methodologies, rigorous safety standards, and tailored development processes.",
          "achievements": [
            "Conducted an extensive literature review on safety-critical systems, focusing on unmanned aircraft systems",
            "Analyzed and documented industry standards and laws for system development",
            "The work primarily involved an in-depth literature review of relevant standards, laws, and safeguarding practices associated with the design and development of unmanned aircraft systems",
            "By exploring the regulatory and technical frameworks, this study provides valuable insights into the processes necessary to ensure the reliability and safety of these advanced systems"
          ],
          "tags": ["Literature Review", "Safety Standards", "Markdown", "LaTeX", "Excel", "Research", "Documentation"]
        },
        {
          "title": "Bachelor's Thesis: Software Architecture Management in the Automotive Sector",
          "company": "Technical University of Clausthal",
          "date": "2013 - 2018",
          "projectId": "software-architecture-project",
          "supervisors": "Prof. Dr. Andreas Rausch, Arthur Strasser",
          "description": "This project centers on Model-Driven Software Development (MDSD), a cutting-edge approach to achieving highly automated software creation. The primary objective was to design and develop a customized tool that supports Model-Driven Architecture (MDA), a pivotal aspect of MDSD, by generating tailored software architecture models derived from a metamodel.",
          "achievements": [
            "Built an eclipse standalone tool to support Model-Driven Architecture (MDA) for customized software solutions",
            "Utilized Java, Eclipse, and UML to address architectural challenges in the automotive industry",
            "Addressed the limitations of standardized frameworks like the Unified Modeling Language (UML)—which often lack flexibility or prove overly complex for specific architectural challenges—the tool is designed to meet the unique demands of the automotive industry",
            "By automating critical development steps and delivering architecture solutions optimized for real-world needs, this work demonstrates innovation in streamlining software development processes while driving efficiency and adaptability in safety-critical industries"
          ],
          "tags": ["Eclipse", "GMF/EMF", "Java", "UML", "Model-Driven Development", "Automotive", "Architecture"]
        },
        {
          "title": "Bachelor's Project: Smart Beer Bar System",
          "company": "Technical University of Clausthal",
          "date": "2013 - 2018",
          "projectId": "smart-beer-bar-project",
          "supervisors": "Benjamin Fischer, Yong Wang, Prof. Dr. Andreas Rausch",
          "description": "This project involved the development of a smart beer bar management system designed to enhance user experience and operational efficiency. The system allows users to log in, view personalized details such as beer consumption in liters, manage other users and their consumption data, and securely log out.",
          "achievements": [
            "Developed a cross-platform, real-time management system using C++, Qt, and SQLite, enabling seamless tracking of beer consumption, user data, and inventory",
            "Implemented user authentication and role-based access controls, ensuring data security and allowing different levels of user interaction (admin, user, guest)",
            "Optimized inventory management by automating consumption tracking, reducing manual efforts and providing real-time insights into stock levels and user behavior",
            "Built using C++, Qt, SQLite, and developed in Eclipse and Qt Creator on Ubuntu, the project demonstrates a seamless integration of modern technologies to create a user-friendly and efficient solution"
          ],
          "tags": ["C++", "Qt", "SQLite", "Eclipse", "Qt Creator", "Ubuntu", "UML", "Cross-Platform"]
        },
        {
          "title": "Notable Project: Electric Vehicle Simulator",
          "company": "Technical University of Clausthal",
          "date": "2013 - 2018",
          "projectId": "electric-vehicle-simulator-project",
          "supervisors": "Meng Zhang",
          "description": "This project focuses on developing an electric vehicle simulator to address key challenges such as range limitations and high costs associated with electric cars. The simulator enables users to simulate a trip and receive an evaluation of their driving performance upon completion.",
          "achievements": [
            "Designed and integrated an interactive driver-simulator module using Java and OpenDS, allowing users to simulate electric vehicle trips and receive detailed performance evaluations",
            "Implemented a feedback loop to analyze energy consumption and optimize trip performance, helping to improve electric vehicle efficiency and user experience",
            "Collaborated with a cross-functional team to ensure the simulator aligned with the real-world specifications of electric vehicles, enhancing the accuracy of results and simulations",
            "Divided into several sub-projects, this programming internship specifically involved the implementation of a driver-simulator interaction, built using Java"
          ],
          "tags": ["Eclipse", "Java", "UML", "OpenDS", "Java SWT", "Java Swing", "Simulation"]
        },
        {
          "title": "Notable Project: Parking Management System",
          "company": "Technical University of Clausthal",
          "date": "2013 - 2018",
          "projectId": "parking-management-project",
          "supervisors": "Meng Zhang",
          "description": "This project addresses the growing challenge of finding parking in crowded urban areas while contributing to the advancement of autonomous driving by automating parking management. The goal was to create a real-time parking management system that allows users to easily monitor the availability of parking spaces.",
          "achievements": [
            "Developed a real-time parking management application for Android, using Python, TypeScript, and Java, enabling users to find available parking spots based on sensor data and user input",
            "Integrated data visualization tools for users to easily view parking availability and reservation status, improving the overall user experience",
            "Streamlined communication with backend servers to ensure up-to-date and accurate parking lot status, allowing efficient management of parking resources in high-demand areas",
            "The system was built using Python, TypeScript, and Java (Android), showcasing expertise in mobile development, backend services, and sensor data integration for autonomous systems"
          ],
          "tags": ["Java Android", "Python", "TypeScript", "UML", "Mobile Development", "Backend Services"]
        },
        {
          "title": "Notable Project: Graph Database Comparison",
          "company": "Technical University of Clausthal",
          "date": "2013 - 2018",
          "projectId": "graph-database-comparison-project",
          "supervisors": "Gerrit Burmester, B.Sc.",
          "description": "This project involved a comprehensive performance comparison between two leading NoSQL graph databases: Neo4j and ArangoDB. The objective was to assess the strengths and capabilities of each database to determine which offers superior performance for graph-based data management.",
          "achievements": [
            "Conducted performance benchmarking between Neo4j and ArangoDB, writing Python scripts to evaluate query efficiency and scalability under various real-world scenarios",
            "Analyzed and presented findings to stakeholders, providing actionable insights to optimize database selection for different types of graph-based applications",
            "Developed custom testing scripts to simulate data workloads, ensuring that performance metrics were relevant to industry standards and real-world usage",
            "To achieve this, I developed and executed a series of benchmark tests using a custom Python script, enabling a detailed analysis of each database's efficiency and scalability"
          ],
          "tags": ["Neo4j", "ArangoDB", "Python", "NoSQL", "Graph Databases", "Performance Testing"]
        },
        {
          "title": "Research Assistant - Software Development and Automation",
          "company": "Technical University of Clausthal",
          "date": "April 2021 - 2022",
          "projectId": "research-assistant-automation",
          "achievements": [
            "Built simulation tools using Python and ROS2 for monitoring security-critical drone systems, improving system reliability and performance",
            "Automated data collection and analysis for drone control systems using Python, ROS2 and Airsim, reducing the time required for experimental setups",
            "Collaborated with international teams to align research objectives with regulatory standards and safety protocols in the drone industry",
            "Collaborated remotely with local teams via BigBlueButton (BBB) and GitLab to ensure smooth communication and version control"
          ],
          "tags": ["Python", "ROS2", "AirSim", "Drone Systems", "Research"]
        },
        {
          "title": "Research Assistant",
          "company": "Technical University of Clausthal",
          "date": "2014 - 2018",
          "projectId": "research-assistant-general",
          "achievements": [
            "Developed and maintained software solutions in Java for various research projects, automating workflows and improving the efficiency of data collection and analysis processes",
            "Utilized version control systems using Subversion (SVN), ensuring seamless collaboration and traceability of code changes between multiple research teams",
            "Extended MS Excel functionalities with VBA Excel to support colleagues in time registration and data management",
            "Designed and implemented modular applications using the MVC architecture pattern, ensuring scalability and maintainability of research tools",
            "Implemented automated testing using JUnit to ensure software stability, reducing bugs and errors and improving the reliability of research outputs",
            "Followed the V-Model XT method for software development, adhering to structured and systematic processes to meet project requirements and quality standards",
            "Collaborated with teams using SharePoint for documentation and Subversion (SVN) for version control, streamlining code management across multiple research projects",
            "Utilized Eclipse IDE for efficient development and debugging of Java-based research applications, accelerating the development cycle",
            "Automated Excel workflows with custom VBA macros, saving significant manual effort and improving the accuracy of time registration processes for team members",
            "Worked independently to deliver high-quality software solutions that supported various research initiatives, demonstrating strong problem-solving skills and self-management"
          ],
          "tags": ["Java", "VBA Excel", "MVC", "JUnit", "SVN", "SharePoint", "Research", "Eclipse"]
        }
      ]
    }
  ],
  "skills": [
    {
      "category": "Programming Languages",
      "items": [
        {"name": "Python", "level": "95"},
        {"name": "Java", "level": "90"},
        {"name": "JavaScript", "level": "90"},
        {"name": "TypeScript", "level": "90"},
        {"name": "PHP", "level": "85"},
        {"name": "C++", "level": "85"},
        {"name": "VBA Excel", "level": "90"}
      ]
    },
    {
      "category": "Frameworks & Tools",
      "items": [
        {"name": "UiPath", "level": "95"},
        {"name": "Django", "level": "90"},
        {"name": "FastAPI", "level": "90"},
        {"name": "Spring Boot", "level": "85"},
        {"name": "NestJS", "level": "85"},
        {"name": "Next.js", "level": "90"},
        {"name": "React", "level": "90"},
        {"name": "React Native", "level": "85"},
        {"name": "Expo", "level": "85"},
        {"name": "Laravel", "level": "85"},
        {"name": "Express.js", "level": "85"},
        {"name": "TensorFlow", "level": "75"}
      ]
    },
    {
      "category": "Frontend Libraries & Tools",
      "items": [
        {"name": "Tailwind CSS", "level": "90"},
        {"name": "React Hook Form", "level": "85"},
        {"name": "Zod", "level": "85"},
        {"name": "Zustand", "level": "85"},
        {"name": "TanStack Query", "level": "85"},
        {"name": "Framer Motion", "level": "80"},
        {"name": "next-intl", "level": "85"},
        {"name": "Prisma", "level": "85"},
        {"name": "NextAuth.js", "level": "85"},
        {"name": "TypeORM", "level": "85"}
      ]
    },
    {
      "category": "Databases",
      "items": [
        {"name": "PostgreSQL", "level": "90"},
        {"name": "MySQL", "level": "85"},
        {"name": "Oracle SQL", "level": "85"},
        {"name": "SQLite", "level": "85"},
        {"name": "Redis", "level": "85"},
        {"name": "TimescaleDB", "level": "80"},
        {"name": "Neo4j", "level": "75"},
        {"name": "ArangoDB", "level": "75"}
      ]
    },
    {
      "category": "Message Queues & Event Streaming",
      "items": [
        {"name": "RabbitMQ", "level": "85"},
        {"name": "Kafka", "level": "75"},
        {"name": "Celery", "level": "85"},
        {"name": "Bull Queue", "level": "80"}
      ]
    },
    {
      "category": "Real-Time & WebSockets",
      "items": [
        {"name": "WebSockets", "level": "85"},
        {"name": "Socket.io", "level": "85"},
        {"name": "Django Channels", "level": "80"}
      ]
    },
    {
      "category": "DevOps & Cloud",
      "items": [
        {"name": "Git", "level": "95"},
        {"name": "GitLab CI/CD", "level": "85"},
        {"name": "Docker", "level": "90"},
        {"name": "Docker Compose", "level": "90"},
        {"name": "Jenkins", "level": "80"},
        {"name": "Maven", "level": "90"},
        {"name": "Nginx", "level": "85"},
        {"name": "Prometheus", "level": "80"},
        {"name": "Grafana", "level": "80"},
        {"name": "AWS", "level": "80"},
        {"name": "AWS S3", "level": "80"},
        {"name": "AWS EKS", "level": "75"},
        {"name": "CI/CD", "level": "85"}
      ]
    },
    {
      "category": "Third-Party Integrations",
      "items": [
        {"name": "Stripe", "level": "85"},
        {"name": "PayPal", "level": "80"},
        {"name": "OpenAI API", "level": "80"},
        {"name": "Firebase", "level": "80"},
        {"name": "SendGrid", "level": "80"}
      ]
    },
    {
      "category": "Testing & Quality",
      "items": [
        {"name": "Pytest", "level": "85"},
        {"name": "Jest", "level": "80"},
        {"name": "Playwright", "level": "75"}
      ]
    },
    {
      "category": "Backend Tools & Libraries",
      "items": [
        {"name": "SQLAlchemy", "level": "85"},
        {"name": "Alembic", "level": "85"},
        {"name": "Pydantic", "level": "85"},
        {"name": "Passport.js", "level": "85"},
        {"name": "bcrypt", "level": "85"},
        {"name": "Multer", "level": "80"},
        {"name": "Nodemailer", "level": "80"}
      ]
    }
  ],
  "education": [
    {
      "icon": "fas fa-graduation-cap",
      "degree": "Master of Science in Computer Science",
      "institution": "Technical University of Clausthal",
      "date": "2018 - 2024",
      "description": "<strong>Thesis:</strong> End-to-End Learning System for Autonomous Drone Navigation<br><strong>Tools:</strong> Python, Pandas, TensorFlow, Keras, AirSim, Git, GitLab<br><strong>Key Achievement:</strong> Developed an autonomous drone navigation system reaching level-4 navigation features.<br><strong>Completed Coursework:</strong> Automation Engineering, Embedded Systems Modeling<br><strong>Personal Growth:</strong> Advanced proficiency in Python, Pandas, Keras, and Scikit-learn through academic projects."
    },
    {
      "icon": "fas fa-graduation-cap",
      "degree": "Bachelor of Science in Computer Science",
      "institution": "Technical University of Clausthal",
      "date": "2013 - 2018",
      "description": "<strong>Thesis:</strong> Software Architecture Management in Automotive Sector<br><strong>Tools:</strong> Java, Eclipse, UML, GMF/EMF<br><strong>Key Achievement:</strong> Designed and implemented a custom software architecture tool supporting Model-Driven Architecture for safety-critical systems.<br><strong>Completed Coursework:</strong> Software Engineering, Distributed Systems, Database, Embedded Systems, Logic and Verification, Software Ergonomic<br><strong>Personal Growth:</strong> Proficient in Java, UML, and GMF/EMF modeling for tool development."
    },
    {
      "icon": "fas fa-school",
      "degree": "High School Diploma",
      "institution": "Gymnasium",
      "date": "2005 - 2011",
      "description": "<strong>Location:</strong> Cameroon<br><strong>Additional Achievement:</strong> Learned German language after graduation and obtained the highest language level certificate."
    }
  ],
  "contactInfo": [
      {
        "icon": "fas fa-envelope",
        "title": "Email",
      "content": "asok.va20@gmail.com"
      },
      {
        "icon": "fas fa-phone",
        "title": "Phone",
      "content": "+49 176 77016856"
      },
      {
        "icon": "fas fa-map-marker-alt",
        "title": "Location",
      "content": "Zapfenweg 18, 60120 Halle (Saale), Saxony-Anhalt, Germany"
      },
      {
        "icon": "fas fa-download",
      "title": "Resume",
      "downloadButtons": [
        {
          "url": "downloads/cv-anthony-okala.pdf",
          "icon": "fas fa-file-pdf",
          "text": "PDF Version"
        },
        {
          "url": "downloads/cv-anthony-okala.md",
          "icon": "fas fa-file-alt",
          "text": "MD Version"
        }
      ]
    }
  ]
}